//
//  main.swift
//  homework5
//
//  Created by Дмитрий Виноградов on 20.08.2021.
//

import Foundation



// Создать протокол «Car» и описать свойства, общие для автомобилей, а также метод действия.
// Создать расширения для протокола «Car» и реализовать в них методы конкретных действий с автомобилем: открыть/закрыть окно, запустить/заглушить двигатель и т.д. (по одному методу на действие, реализовывать следует только те действия, реализация которых общая для всех автомобилей).
// Создать два класса, имплементирующих протокол «Car»: tunkCar и sportCar. Описать в них свойства, отличающиеся для спортивного автомобиля и цистерны.
// Для каждого класса написать расширение, имплементирующее протокол «CustomStringConvertible».
// Создать несколько объектов каждого класса. Применить к ним различные действия.
// Вывести сами объекты в консоль.

